---
kind: method
id: M:Autodesk.Revit.DB.ComponentRepeaterIterator.GetCurrent
source: html/ee497b3e-29ac-ff1d-3502-7f54f4e8b8f6.htm
---
# Autodesk.Revit.DB.ComponentRepeaterIterator.GetCurrent Method

Returns the current repeater slot.

## Syntax (C#)
```csharp
public ComponentRepeaterSlot GetCurrent()
```

## Returns
The current slot.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - There is no current item in the iterator.